Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.AddLeg Method (ConnectiveGeometry, Contour)
 Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry AddLeg(
	ConnectiveGeometry geometry,
	Contour polygon
)
Public Function AddLeg (
	geometry As ConnectiveGeometry,
	polygon As Contour
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
ConnectiveGeometry used to create a connection with.
polygon
Type: Tekla.Structures.Model.Contour
The polygonal contour to add to geometry.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not create or modify ConnectiveGeometry instance.
ArgumentException | Thrown when geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.
See Also
Reference
BentPlateGeometrySolver Class
AddLeg Overload
Tekla.Structures.Model Namespace